taurus tests/put.yaml
execution:
- concurrency: 1
  ramp-up: 5s
  hold-for: 2m
  throughput: 100
  scenario: TwoCheckout



scenarios:
  TwoCheckout:
    default-address: http://127.0.0.1:5000/
    requests:



      - url: /city/1
        method: PUT
        headers:
          content-type: application/json
          Authorization: "Basic dG9tOjMyMQ=="
        body:
          inhabitants: 334


      - url: /sensor/1
        method: PUT
        headers:
          content-type: application/json
          Authorization: "Basic dG9tOjMyMQ=="
        body:
          inhabitants: 334


      - url: /sensordata/1
        method: PUT
        headers:
          content-type: application/json
          Authorization: "Basic dG9tOjMyMQ=="









# check 404
      - url: /city/6666
        method: PUT
        headers:
          content-type: application/json
          Authorization: "Basic dG9tOjMyMQ=="
        assert:
          - assume-success: true
            contains:
              - 404
            subject: http-code

      - url: /sensor/6666
        method: PUT
        headers:
          content-type: application/json
          Authorization: "Basic dG9tOjMyMQ=="
        assert:
          - assume-success: true
            contains:
              - 404
            subject: http-code

      - url: /sensordata/66666
        method: PUT
        headers:
          content-type: application/json
          Authorization: "Basic dG9tOjMyMQ=="
        assert:
          - assume-success: true
            contains:
              - 404
            subject: http-code